{
  "kind": "build_request",
  "title": "Ensure all puns are NEAR-focused while including ICP and other Web3 comparisons",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Update the backend pun catalog so that every generated pun is explicitly about NEAR (i.e., each output must include the literal text \"NEAR\"), while still allowing comparisons that mention ICP and other Web3 projects/protocols.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No the puns need to be about NEAR but comparison should also include ICP among other web3 related stuff"
        ]
      },
      "acceptanceCriteria": [
        "Calling generatePun(...) never returns a pun that omits the substring \"NEAR\".",
        "Puns that previously only mentioned ICP are revised so they also reference NEAR (e.g., as a comparison/contrast), rather than being ICP-only jokes.",
        "Template-based puns that currently do not mention NEAR are revised so the assembled output includes NEAR."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Expand backend content coverage so a meaningful portion of generated NEAR-focused puns also include direct comparisons to ICP and additional Web3-related projects/protocols (while keeping NEAR as the primary subject of the joke).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "comparison should also include ICP among other web3 related stuff"
        ]
      },
      "acceptanceCriteria": [
        "The backend includes new or updated hand-written puns and/or templates that mention NEAR and ICP together in a substantial portion of outputs.",
        "The backend includes new or updated content that mentions NEAR plus at least several other Web3-related projects/protocols (in addition to ICP).",
        "Repeated calls to generatePun(...) can produce outputs that compare NEAR vs ICP as well as NEAR vs other Web3 projects/protocols, without changing the frontend API shape."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Adjust backend content-safety guardrails so NEAR-vs-ICP and NEAR-vs-other-Web3 comparison puns are not incorrectly rejected as unsafe, while still ensuring outputs remain focused on blockchain/protocol satire (not attacks on protected classes).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "comparison should also include ICP among other web3 related stuff"
        ]
      },
      "acceptanceCriteria": [
        "generatePun(...) does not frequently return fallback error strings like \"Template contains unsafe content...\" for legitimate NEAR/ICP/Web3 protocol satire puns.",
        "Safety checks continue to enforce that puns remain about protocols/projects (e.g., NEAR and other Web3 terms) rather than drifting into unrelated content.",
        "Frontend generation (useGeneratePun) does not start failing more often due to backend returning strings containing \"unsafe content\" after the content expansion."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in backend/main.mo.",
    "Do not edit frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep the backend method signature for generatePun(randomIndex, randomFocusIndex) compatible with the current frontend caller."
  ],
  "nonGoals": [
    "Adding new pages or major UI changes.",
    "Introducing third-party APIs, databases, or non-Motoko backend services.",
    "Changing authentication beyond the existing Internet Identity setup."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}